app/views/pages/home.html.erb

                            <div class="col-sm-6" style="font-size: 80%; opacity: 0.7;">TWEETS<br>
                                <h6 style="color: #0084B4; font-size: 200%;"><%= current_user.posts.count %></h6>
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC

                <div class="col-sm-11">
                    <p class="post-title"><span class="post-owner"><%= User.find(@p.user_id).username %></span> <span class="post-creation">- <%= @p.created_at.to_formatted_s(:short) %></span></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]